[
  {
    "slug": "why-cant-taxi-take-me-to-the-door",
    "title": "Why can't my taxi take me to the door?",
    "category": "arrival-logistics",
    "shortAnswer": "Riads are nestled in car-free zones of the medina.",
    "sections": [
      {
        "content": "Vehicles circulate on the main roads inside the walls, but the streets — or derbs — where riads are located narrow to a metre or two — wide enough for pedestrians, donkeys, and motorbikes, not cars. Your taxi drops you at the closest point a vehicle can reach, and you walk the rest."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-is-the-tourist-tax",
    "title": "What is the tourist tax?",
    "category": "arrival-logistics",
    "shortAnswer": "A government levy (taxe de séjour) of approximately €2.50 per person per night.",
    "sections": [
      {
        "content": "Children under 12 are exempt. Some properties include it in the room rate, others add it at checkout — both are legal. The tourist tax is usually paid in cash."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "is-there-a-ride-hailing-app",
    "title": "Is there a ride-hailing app?",
    "category": "arrival-logistics",
    "shortAnswer": "inDrive is the most widely used. Uber relaunched in late 2025.",
    "sections": [
      {
        "content": "inDrive has over 50,000 drivers in ten cities. You propose a fare, the driver counters, you agree. Cash only. It's technically illegal (the Ministry of Transport rejected their licence in 2025), which means police occasionally stop inDrive vehicles and ask questions. The driver will tell you to say you're a friend, not a passenger. For a few dirhams saved over a regular taxi, it's a lot of hassle."
      },
      {
        "content": "Uber relaunched in Casablanca and Marrakech in late 2025 with licensed operators, fixed pricing, and card payment. Smaller footprint than inDrive."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "how-do-i-get-a-petit-taxi-to-use-the-meter",
    "title": "How do I get a petit taxi to use the meter?",
    "category": "arrival-logistics",
    "shortAnswer": "Say compteur before the car moves.",
    "sections": [
      {
        "content": "If the driver refuses, agree a price or try the next one — there's always another. Taxis are colour-coded by city: Marrakech ochre, Casablanca red, Rabat blue, Fes red, Tangier light blue."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "whats-the-difference-between-petit-and-grand-taxis",
    "title": "What's the difference between petit and grand taxis?",
    "category": "arrival-logistics",
    "shortAnswer": "Petit taxis are city-only and metered. Grand taxis are intercity and shared.",
    "sections": [
      {
        "content": "Petit taxis operate within one city — metered, max 3 passengers, colour-coded. Grand taxis are intercity — 6 passengers, fixed fare per seat, they leave when full. Grand taxi stands cluster near the bus station (*gare routière*). If you don't want to wait, you can buy the empty seats."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "how-do-trains-work",
    "title": "How do trains work?",
    "category": "arrival-logistics",
    "shortAnswer": "ONCF runs everything. Al Boraq is Africa's only high-speed rail.",
    "sections": [
      {
        "content": "Al Boraq runs Tangier to Casablanca in 2h10m. The conventional Al Atlas network connects Casablanca to Marrakech (~3h) and Fes (~4h). There are no trains to Essaouira, Agadir, Chefchaouen, or anywhere in the south. Supratours buses connect from train stations to everywhere trains don't reach. Book at [oncf.ma](https://www.oncf.ma)."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "how-do-buses-work",
    "title": "How do buses work?",
    "category": "arrival-logistics",
    "shortAnswer": "Two names: Supratours and CTM.",
    "sections": [
      {
        "content": "Two names: [Supratours](https://www.supratours.ma) (run by ONCF, departs from train stations) and [CTM](https://www.ctm.ma) (independent, broader network). Both are modern and air-conditioned. Marrakech to Essaouira: about 3 hours, 80–100 MAD. Popular routes sell out on weekends — especially Marrakech–Essaouira and Fes–Chefchaouen."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-plugs-do-they-use",
    "title": "What plugs do they use?",
    "category": "arrival-logistics",
    "shortAnswer": "Type C and E — same as France.",
    "sections": [
      {
        "content": "If you're coming from continental Europe, your plugs work. From the UK, US, or Australia, you'll need an adapter. Most riads have a limited number of outlets per room — the buildings predate the era of charging four devices at once. A small power strip is more useful than a multi-adapter."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-is-a-medina",
    "title": "What is a medina?",
    "category": "the-medina",
    "shortAnswer": "The Arabic word for \"city.\"",
    "sections": [
      {
        "content": "In Morocco, it refers to the old walled city — the original urban centre, built before cars, with narrow streets, mosques, markets, and residential quarters packed inside defensive walls. Every major Moroccan city has one. The modern city (ville nouvelle) was built outside the walls during the French protectorate, starting in 1912. When people say \"the medina,\" they mean the old city inside the walls."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-is-my-gps-wrong",
    "title": "Why is my GPS wrong?",
    "category": "the-medina",
    "shortAnswer": "High walls bounce GPS signals — errors of 10 to 30 metres.",
    "sections": [
      {
        "content": "In a city where parallel streets are five metres apart, that's enough to place you on the wrong one entirely. Google Street View cars can't enter streets narrower than their wheelbase, which means most of the medina isn't mapped at ground level. Locals navigate by landmarks — the fountain, the bakery, the mosque."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-does-balak-mean",
    "title": "What does \"Balak!\" mean?",
    "category": "the-medina",
    "shortAnswer": "Move aside.",
    "sections": [
      {
        "content": "A donkey or handcart is behind you and can't stop. It's not rude — it's a warning. The unwritten rule: the thing hardest to stop has right of way."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-the-bathroom-smell",
    "title": "Why does the bathroom smell?",
    "category": "the-medina",
    "shortAnswer": "Dry drain traps. Run the tap for ten seconds.",
    "sections": [
      {
        "content": "The drain has a U-shaped trap that holds water — a seal between your bathroom and the sewer line below. In Marrakech heat, that water evaporates fast, sometimes within a day. Once the trap is dry, sewer gas rises straight through the drain. Run the tap for ten seconds to refill it. The medina's sewage system is centuries old, and multiple properties share the same drainage channels — a blockage three doors down can push gases back through yours."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-is-the-riad-so-hard-to-find",
    "title": "Why is the riad so hard to find?",
    "category": "the-medina",
    "shortAnswer": "The door is designed to blend into the wall.",
    "sections": [
      {
        "content": "Same colour, no sign, no shop front. This is deliberate: in medina architecture, the exterior reveals nothing about what's inside. Most riads send someone to meet you at a recognisable drop-off point, or guide you in by WhatsApp voice or video call."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-is-it-so-cold-inside-in-winter",
    "title": "Why is it so cold inside in winter?",
    "category": "the-medina",
    "shortAnswer": "Thermal mass works both ways.",
    "sections": [
      {
        "content": "The same thick walls that keep riads cool in summer absorb cold in winter and radiate it inward. Marrakech nights drop to 5–8°C from November through February. Most traditional riads weren't built with heating — the architecture was designed for a hot climate, and winter was something you layered for, not engineered against."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-can-you-hear-everything",
    "title": "Why can you hear everything?",
    "category": "the-medina",
    "shortAnswer": "The courtyard is a vertical amphitheatre.",
    "sections": [
      {
        "content": "Hard surfaces — zellige tile, lime plaster, stone — reflect rather than absorb sound. A conversation at the breakfast table carries to the second-floor balcony. Traditional wooden doors have gaps at the bottom designed for airflow, not soundproofing."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-are-the-beds-so-hard",
    "title": "Why are the beds so hard?",
    "category": "the-medina",
    "shortAnswer": "That's how they're meant to feel in Morocco.",
    "sections": [
      {
        "content": "Moroccan mattresses are traditionally firm — wool-stuffed or high-density foam on solid bases. The tradition comes from the *sedari*, the firm cushioned benches that line the walls of Moroccan living rooms and double as seating and sleeping surfaces. Firmness is a sign of quality, not neglect."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-are-there-cockroaches-in-a-clean-riad",
    "title": "Why are there cockroaches in a clean riad?",
    "category": "the-medina",
    "shortAnswer": "Climate and infrastructure, not hygiene.",
    "sections": [
      {
        "content": "Buildings in the medina share walls and drainage channels — entire city blocks are connected underground. A cockroach in a spotless riad didn't originate there. The species that thrives here (Periplaneta americana) can flatten through a 3mm gap and breeds in temperatures Marrakech maintains for seven months of the year."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-is-it-so-loud-at-430am",
    "title": "Why is it so loud at 4:30am?",
    "category": "the-medina",
    "shortAnswer": "The call to prayer (Fajr) from minarets.",
    "sections": [
      {
        "content": "In the medina, you're within range of several mosques at once, and the calls don't synchronise perfectly — they arrive as overlapping waves. Stone walls and open courtyards amplify rather than absorb the sound. Most people stop noticing within two or three nights."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-was-the-2023-earthquake",
    "title": "What was the 2023 earthquake?",
    "category": "the-medina",
    "shortAnswer": "Magnitude 6.8, 8 September 2023.",
    "sections": [
      {
        "content": "Nearly 3,000 people died — but the devastation was concentrated in remote High Atlas mountain villages like Amizmiz, Moulay Brahim, and Talat N'Yacoub, not in the cities. The medina of Marrakech sustained mostly cosmetic damage and was fully operational within days. Reconstruction in the mountain communities continues — these villages depend on visiting hikers, guesthouse stays, and guided walks for their economy."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-are-the-walls-stained-or-bubbling",
    "title": "Why are the walls stained or bubbling?",
    "category": "the-medina",
    "shortAnswer": "Efflorescence — mineral salts pushed to the surface by moisture.",
    "sections": [
      {
        "content": "The medina sits on a high water table, and the centuries-old walls wick moisture upward through porous materials. When the water evaporates, it leaves white crystalline deposits on plaster and paint. This is the nature of the building, not a sign of neglect."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-are-the-floors-stained-or-uneven",
    "title": "Why are the floors stained or uneven?",
    "category": "the-medina",
    "shortAnswer": "Handmade tiles are porous by nature.",
    "sections": [
      {
        "content": "Bejmat (handmade terracotta floor tiles) and zellige absorb moisture, oils, and pigment over time. Staining, discolouration, and surface wear are signs of age and material. Factory tiles wouldn't behave this way. Handmade tiles are individually fired and laid by hand, which is also why no two are perfectly level."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-the-wifi-barely-work",
    "title": "Why does the wifi barely work?",
    "category": "the-medina",
    "shortAnswer": "Thick walls block the signal.",
    "sections": [
      {
        "content": "Riads are built from dense stone, brick, and lime plaster — materials that absorb wifi signals the way they absorb sound. A single router in the courtyard struggles to reach rooms on upper floors or behind multiple walls. This is a limitation of the architecture, not the internet connection."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-the-electricity-flicker",
    "title": "Why does the electricity flicker?",
    "category": "the-medina",
    "shortAnswer": "Old wiring and shared circuits.",
    "sections": [
      {
        "content": "Many medina buildings run on electrical systems installed decades ago, with multiple properties sharing the same supply line. In summer, when air conditioning and refrigeration peak, the load exceeds what the infrastructure was designed for. Brief outages and voltage drops are common, especially in the afternoon heat."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-are-there-cats-everywhere",
    "title": "Why are there cats everywhere?",
    "category": "the-medina",
    "shortAnswer": "They're the city's pest control.",
    "sections": [
      {
        "content": "Cats have been part of medina life for centuries. They keep the rat and mouse population down in a city built on narrow streets and open drains. They're tolerated, fed scraps by shopkeepers and residents, and largely left to roam. Most are semi-feral — friendly enough to approach but not domesticated. Some have eye infections or are underfed. A handful of cat food and a few dirhams' worth of eye drops from any pharmacy will be much appreciated."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "is-it-rude-to-refuse-tea",
    "title": "Is it rude to refuse tea?",
    "category": "social-cultural",
    "shortAnswer": "Tea is a social contract.",
    "sections": [
      {
        "content": "Offering it means you're being received as a guest. Accepting means you recognise the relationship. It creates a shared pause — business may follow, or it may not."
      },
      {
        "content": "After the first glass, you can leave without offence. Before the first glass is finished — that's rude. Drinking all three glasses and buying nothing is completely normal."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-should-i-wear",
    "title": "What should I wear?",
    "category": "social-cultural",
    "shortAnswer": "Shoulders and knees covered.",
    "sections": [
      {
        "content": "The medina is a residential neighbourhood — you're walking through streets where families live, children play, and elderly residents sit in doorways. Covering up is about respect for the community, not the law."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "can-i-photograph-people",
    "title": "Can I photograph people?",
    "category": "social-cultural",
    "shortAnswer": "Ask first.",
    "sections": [
      {
        "content": "A gesture toward your camera and a raised eyebrow is enough — most people will nod or wave no. This applies to everyone — Moroccans and foreigners living in the medina alike. Snake charmers, musicians, and water sellers perform for the camera and expect 10–20 MAD. Women and children should not be photographed without explicit consent."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "can-you-show-affection-in-public",
    "title": "Can you show affection in public?",
    "category": "social-cultural",
    "shortAnswer": "Kissing or heavy physical contact is culturally out of place and legally punishable.",
    "sections": [
      {
        "content": "Article 483 of the Penal Code. Walking together, a light touch, a hand on the back — fine. This applies equally to everyone, Moroccan and foreign."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "is-morocco-safe-for-lgbtq-visitors",
    "title": "Is Morocco safe for LGBTQ+ visitors?",
    "category": "social-cultural",
    "shortAnswer": "Same-sex sexual activity is illegal under Article 489 — 6 months to 3 years.",
    "sections": [
      {
        "content": "Actively enforced: 838 prosecutions between 2017 and 2020. The law applies to everyone — Moroccan, foreign, men, women. Discretion is essential, not optional."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "should-you-remove-shoes",
    "title": "Should you remove shoes?",
    "category": "social-cultural",
    "shortAnswer": "In homes, riad living areas, and mosques — yes.",
    "sections": [
      {
        "content": "The cue is visible: a row of shoes at the door, a mat, or your host in slippers. In shops and commercial spaces, shoes stay on."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-time-work-differently-here",
    "title": "Why does time work differently here?",
    "category": "social-cultural",
    "shortAnswer": "Two systems running at once.",
    "sections": [
      {
        "content": "Official time follows the clock. Social time follows context — finishing the conversation you're in takes priority over starting the next one on schedule. The five daily prayers are fixed to the sun, not the clock, and shift by minutes every day. Shops close for prayer, reopen, close for heat, reopen for evening."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-everyone-want-cash",
    "title": "Why does everyone want cash?",
    "category": "social-cultural",
    "shortAnswer": "Card acceptance is patchy.",
    "sections": [
      {
        "content": "Riads, upscale restaurants, and supermarkets usually accept cards. Most of the medina runs on cash — taxis, street food, souks, small shops, tips. ATMs are plentiful but charge withdrawal fees (typically 20–30 MAD per transaction). Carry small notes — breaking a 200 MAD note at a corner shop is difficult."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "how-does-bargaining-work",
    "title": "How does bargaining work?",
    "category": "social-cultural",
    "shortAnswer": "Expected in souks, not everywhere.",
    "sections": [
      {
        "content": "Bargaining is standard in the souks and with freelance services — taxis without meters, guides, market stalls. It's not expected in restaurants, supermarkets, pharmacies, or shops with printed price tags. The opening price in a souk is not a scam — it's the start of a conversation. There's no fixed rule like \"offer half.\" The real price depends on the item, the season, and how many tourists walked past that day."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-everyone-ask-where-im-from",
    "title": "Why does everyone ask where I'm from?",
    "category": "social-cultural",
    "shortAnswer": "Conversational opener, not interrogation.",
    "sections": [
      {
        "content": "Moroccans are multilingual and genuinely curious — your answer tells them which language to switch to. It's also a form of hospitality: placing you means they can offer something relevant, whether that's a recommendation, a connection, or just a warmer greeting. It's the Moroccan equivalent of small talk about the weather."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-do-people-stare",
    "title": "Why do people stare?",
    "category": "social-cultural",
    "shortAnswer": "Curiosity, not hostility.",
    "sections": [
      {
        "content": "Outside the main tourist circuits, a foreign face is simply unusual. Staring in Morocco doesn't carry the same social weight it does in Northern Europe or North America — it's observation, not confrontation. Children will stare openly, older men from café chairs, women from windows. A nod or a smile usually gets one back."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "can-i-drink-the-tap-water",
    "title": "Can I drink the tap water?",
    "category": "food-drink",
    "shortAnswer": "Safe but mineral-heavy.",
    "sections": [
      {
        "content": "Morocco's tap water comes from Atlas limestone aquifers — high in calcium and magnesium, which gives it a noticeable taste, especially in older buildings where decades-old pipes add their own character. Most people buy bottled — Sidi Ali and Sidi Harazem are the local brands, about 5 dirhams for a litre and a half. Brushing your teeth with tap water is fine."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "how-do-you-eat-from-a-shared-tagine",
    "title": "How do you eat from a shared tagine?",
    "category": "food-drink",
    "shortAnswer": "Right hand, bread as utensil, eat from the section in front of you.",
    "sections": [
      {
        "content": "The left hand is considered unclean. Tear a piece of bread ([khobz](https://slowmorocco.com/glossary#khobz)) and use it to scoop. Eat from the section directly in front of you, working inward. Don't reach across. If your host pushes a piece of meat toward you, that's generosity — accept it."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "whats-the-difference-between-a-local-and-a-spa-hammam",
    "title": "What's the difference between a local and a spa hammam?",
    "category": "food-drink",
    "shortAnswer": "Local: 20 dirhams, communal. Spa: 400–800 dirhams, private.",
    "sections": [
      {
        "content": "A local hammam costs about 20 dirhams. It's a communal public facility — men and women use it at separate times, you undress in a shared changing area, and the scrubbing happens in a heated communal room. A spa hammam costs 400–800 dirhams — private rooms, robes, English-speaking staff. Couples can have treatments together."
      },
      {
        "content": "The neighbourhood hammam is also a social institution. Women go weekly, exchange news, catch up. It's routine hygiene, not a treatment or an experience."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-mint-tea-taste-different-here",
    "title": "Why does mint tea taste different here?",
    "category": "food-drink",
    "shortAnswer": "It's not mint-flavoured tea.",
    "sections": [
      {
        "content": "It's Chinese gunpowder green tea brewed strong, combined with fresh spearmint (not peppermint) and a generous amount of sugar. Poured from height to aerate the liquid and create foam. The first glass is poured back into the pot and re-poured until the foam is right. Three rounds, each tasting slightly different as the tea steeps."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "can-you-eat-vegan",
    "title": "Can you eat vegan?",
    "category": "food-drink",
    "shortAnswer": "Easier than expected.",
    "sections": [
      {
        "content": "Many traditional dishes are naturally vegan — vegetable tagine, zaalouk, bissara, couscous with seven vegetables. The difficulty is communication, not availability. The word *vegan* doesn't translate directly — butter, honey, and dairy often don't register as non-vegan. In French: *sans viande, sans produits laitiers, sans œufs*. In Darija: *bidoun lahem, bidoun hlib, bidoun jben, bidoun beid*."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "can-you-drink-alcohol",
    "title": "Can you drink alcohol?",
    "category": "food-drink",
    "shortAnswer": "Legal, available, but not everywhere.",
    "sections": [
      {
        "content": "Licensed bars, restaurants, hotels, and supermarkets (Carrefour, Atacadão) sell alcohol. In the medina itself, visible shops are rare — the culture around alcohol is discreet. Public drinking — streets, parks, beaches — is illegal."
      },
      {
        "content": "Morocco produces its own beer (Casablanca, Flag, Stork) and wine from five regions. Meknès reds are genuinely good. During [Ramadan](https://derb.so/questions/what-is-ramadan), alcohol sales are restricted or suspended in many places."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-is-my-stomach-upset",
    "title": "Why is my stomach upset?",
    "category": "food-drink",
    "shortAnswer": "Change in diet, not food poisoning.",
    "sections": [
      {
        "content": "Moroccan cooking uses olive oil, argan oil, preserved lemons, and spice combinations your gut isn't accustomed to. The shift in fat type, fibre, and seasoning is enough to cause discomfort for the first two or three days. This isn't food poisoning — it's adaptation. Street food stalls with high turnover (the ones with queues of locals) are generally safe. The risk comes from food that's been sitting, not food that's been spiced."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-do-the-henna-ladies-grab-your-hand",
    "title": "Why do the henna ladies grab your hand?",
    "category": "safety",
    "shortAnswer": "The paste stains in seconds and can't be wiped off.",
    "sections": [
      {
        "content": "Once it's on, you're expected to pay — typically 300 to 500 dirhams for a small dribble, a price that's never mentioned beforehand. Hands in pockets or visibly occupied reads as unavailable."
      },
      {
        "content": "The ink used by street henna artists is low quality and stains everything it touches — textiles, towels, bed linen. If you wipe your hands on your riad's towels, the stain is permanent. Henna ink cannot be washed out of fabric."
      },
      {
        "content": "Professional henna is a different thing. Most riads arrange sessions with actual artists — agreed design, agreed price, usually 150–200 dirhams per hand, with proper quality ink."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "are-the-monkeys-in-the-square-ethical",
    "title": "Are the monkeys in the square ethical?",
    "category": "safety",
    "shortAnswer": "No.",
    "sections": [
      {
        "content": "Barbary macaques are endangered primates taken from the wild as infants — mothers are driven from the troop, sometimes killed. The babies have their teeth pulled or filed, are dressed up, chained, and used as photo props. They are listed as Endangered on the IUCN Red List, and capturing or trading them is illegal under Moroccan law and CITES. Every photo taken funds the next capture."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "should-i-take-a-horse-carriage",
    "title": "Should I take a horse carriage?",
    "category": "safety",
    "shortAnswer": "Look for the blue SPANA band on the horse's ankle.",
    "sections": [
      {
        "content": "It means the animal has been veterinary-inspected, microchipped, and passed as fit to work. SPANA (Society for the Protection of Animals Abroad) has operated in Morocco since 1925 and runs the largest equine clinic in the world in Marrakech. Prices are printed on a sticker on the carriage — agree the route and fare before you get in. A few sugar cubes, an apple, or a banana will be appreciated by these beautiful souls."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-is-the-police-touristique",
    "title": "What is the police touristique?",
    "category": "safety",
    "shortAnswer": "Morocco's dedicated tourist police unit.",
    "sections": [
      {
        "content": "They handle theft, harassment, vendor disputes, and overcharging. Officers speak French, some speak English and Spanish. Tourist police units operate in Marrakech, Fes, Casablanca, Rabat, Tangier, and Agadir. Smaller cities like Essaouira and Chefchaouen have general police presence but no dedicated tourist unit."
      },
      {
        "content": "Marrakech station: Place Jemaa el-Fna, near the post office. Direct: +212 524 384 601. 24-hour line: +212 524 888 680."
      },
      {
        "content": "General emergencies: 19 (police, urban), 177 (gendarmerie, rural), 150 (ambulance), 15 (fire), 112 (universal mobile)."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "how-do-i-tell-a-real-guide-from-a-fake-one",
    "title": "How do I tell a real guide from a fake one?",
    "category": "safety",
    "shortAnswer": "Official guides carry a large circular brass badge.",
    "sections": [
      {
        "content": "It's issued by the Ministry of Tourism — visible, hard to miss. Official guides have completed a government training programme and are licensed for specific cities. Anyone without the badge offering to \"show you around\" is freelance. They may know the medina well, but there's no accountability if the tour ends at a cousin's carpet shop. Locals who offer unsolicited directions often expect a tip — 10 to 20 dirhams is standard if you accept."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-do-i-do-if-i-get-lost-at-night",
    "title": "What do I do if I get lost at night?",
    "category": "safety",
    "shortAnswer": "Head toward light.",
    "sections": [
      {
        "content": "A brightly lit shop or a bakery that's still open is your best reference point — ask the shopkeeper for the nearest gate (*bab*) or the \"big square\" where you can re-orient yourself. Shopkeepers are stationary, known in their neighbourhood, and far more reliable than someone approaching you in a dark street. Every medina gate leads to a main road where you can find a taxi."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-do-the-streets-look-sketchy",
    "title": "Why do the streets look sketchy?",
    "category": "safety",
    "shortAnswer": "They're centuries old, not dangerous.",
    "sections": [
      {
        "content": "Narrow, unlit, no signage, peeling walls, cats everywhere, wires overhead. It looks like somewhere you shouldn't be. But the medina isn't zoned the way Western cities are — there's no separation between residential, commercial, and pedestrian. A dark alley with a rusted door might open into someone's home with a marble courtyard. Streets that look abandoned at 10pm are full of schoolchildren at 8am. The infrastructure looks rough because it's centuries old, not because it's dangerous."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-is-ramadan",
    "title": "What is Ramadan?",
    "category": "religious-calendar",
    "shortAnswer": "The Islamic month of fasting from dawn to sunset.",
    "sections": [
      {
        "content": "The ninth month of the Islamic lunar calendar. Muslims fast from dawn to sunset — no food, no water, no smoking. In 2026: approximately 18 February to 19 March. Most tourist businesses stay open. Riads serve breakfast and lunch. Restaurants serving visitors continue to operate."
      },
      {
        "content": "Visitors aren't expected to fast, but eating, drinking, or smoking in the street during daylight draws uncomfortable attention. Indoors — your riad, a restaurant, your hotel — is fine."
      },
      {
        "content": "Ramadan ends with [Eid al-Fitr](https://derb.so/questions/when-are-public-holidays-in-morocco) — a two-day national holiday of celebration and feasting."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "what-is-eid-al-adha",
    "title": "What is Eid al-Adha?",
    "category": "religious-calendar",
    "shortAnswer": "Morocco's most important religious holiday.",
    "sections": [
      {
        "content": "Known locally as Eid el-Kbir or the *Fête du Mouton*. Families sacrifice a sheep to commemorate the Prophet Ibrahim's obedience. The meat is divided into thirds: one for the family, one for relatives and friends, one for those in need."
      },
      {
        "content": "In 2026: around 27 May. The sacrifice happens on the morning of Eid. If you're staying in the medina, you will hear — and smell — it. The holiday lasts two to three days."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "when-are-public-holidays",
    "title": "When are public holidays?",
    "category": "religious-calendar",
    "shortAnswer": "11 fixed national holidays and 4 Islamic holidays that shift annually.",
    "sections": [
      {
        "content": "**Fixed:** 1 Jan (New Year), 11 Jan (Independence Manifesto), 14 Jan (Amazigh New Year/Yennayer), 1 May (Labour Day), 30 July (Throne Day), 14 Aug (Oued Ed-Dahab), 20 Aug (Revolution of the King and the People), 21 Aug (Youth Day), 6 Nov (Green March), 18 Nov (Independence Day)."
      },
      {
        "content": "**Islamic (dates shift):** Eid al-Fitr (2 days), Eid al-Adha (2 days), 1st Muharram (Islamic New Year), Eid al-Mawlid (Prophet's birthday)."
      },
      {
        "content": "Banks and government offices close on public holidays. Tourist-facing businesses mostly stay open."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "can-you-go-inside-the-koutoubia-mosque",
    "title": "Can you go inside the Koutoubia mosque?",
    "category": "cities",
    "shortAnswer": "No.",
    "sections": [
      {
        "content": "Non-Muslims cannot enter the Koutoubia, or virtually any mosque in Morocco. The restriction dates to the French protectorate era and has remained in place since. Two exceptions: the Hassan II Mosque in Casablanca (guided tours daily) and the Tinmel Mosque in the High Atlas."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "why-does-agadir-look-nothing-like-other-moroccan-cities",
    "title": "Why does Agadir look nothing like other Moroccan cities?",
    "category": "cities",
    "shortAnswer": "An earthquake destroyed it in 1960.",
    "sections": [
      {
        "content": "On 29 February 1960, a magnitude 5.8 earthquake destroyed the city in 15 seconds — between 12,000 and 15,000 dead. Agadir was rebuilt from scratch two kilometres south, with wide boulevards, modern architecture, and seismic safety standards. No ancient medina, no winding derbs. The only remnant is the hilltop Kasbah inscription: \"God, Country, King.\""
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "is-casablanca-worth-visiting",
    "title": "Is Casablanca worth visiting?",
    "category": "cities",
    "shortAnswer": "The Hassan II Mosque and the Art Deco district.",
    "sections": [
      {
        "content": "The Hassan II Mosque is one of two Moroccan mosques open to non-Muslims — third-largest in the world, built on a platform over the Atlantic, with a retractable roof and a 210-metre minaret. The 1930s Art Deco district along Boulevard Mohammed V is among the finest in Africa. Beyond that, Casablanca is Morocco's economic capital, not a tourist city. Rick's Café was built in 2004 as a tribute to the film — the movie *Casablanca* was not filmed in Morocco."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "is-rabat-the-capital",
    "title": "Is Rabat the capital?",
    "category": "cities",
    "shortAnswer": "Yes, since 1912.",
    "sections": [
      {
        "content": "The French protectorate chose Rabat over Fes (politically volatile), Marrakech (too far south), and Casablanca (too commercial). Morocco has four imperial cities — Fes, Marrakech, Meknes, and Rabat — each served as a dynastic capital at different points in history."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  },
  {
    "slug": "is-taghazout-still-a-surf-village",
    "title": "Is Taghazout still a surf village?",
    "category": "cities",
    "shortAnswer": "The village and surf culture remain. The coastline south has transformed.",
    "sections": [
      {
        "content": "The original Berber fishing village and its surf culture remain intact — fishermen still launch from the beach, Anchor Point still breaks the way it always has. But major resort development (Fairmont, Hilton, Riu) under Morocco's Vision 2030 has transformed the coastline south of the village. Surf season: September to April, peaking December through March."
      }
    ],
    "illustrations": [],
    "lastUpdated": "2026-02-09",
    "relatedSlugs": [],
    "searchTerms": [],
    "backlinks": [],
    "tags": [],
    "sources": []
  }
]